glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
							if (heater->max_throttle_timeout == 0)
								{
								printf("<HTR> dev[%02d]: full throttle limiter\n", heater->indx);
								duty_ratio= PWM_WARM_CONST_FACTOR;
								heater->pid_state= HTR_PID_STATE_FULLTHR_LIMITER;
								}
							else
								printf("<HTR> dev[%02d]: full throttle timer: %03d\n", heater->indx, heater->max_throttle_timeout);
							}

						if ((heater->owp_state == 0x00) && (duty_ratio > 900) && (heater->max_throttle_timeout_active == false))
							{
							// za³¹czenie timera
							heater->max_throttle_timeout= PWM_MAX_THROTTLE_TIMEOUT;
							heater->max_throttle_timeout_active= true;

							printf("<HTR> dev[%02d]: full throttle timer start\n", heater->indx);
							}


						if (open_window_status(heater))
							{
							// wykryto otwarcie okna, wy³¹czam grzanie

							printf("<HTR> dev[%02d]: CLOSED, OPEN WINDOW PROTECTION\n", heater->indx);

							// wy³¹czenie timera
							heater->max_throttle_timeout_active= false;
							heater->max_throttle_timeout= 0;

							duty_ratio= 0;
							heater->pid_state= HTR_PID_STATE_OWP;
							} // open_window_status




						// zabezpieczenie przed maksymaln¹ temperatur¹
						if ((duty_ratio != 0) && (heater->temp_current >= MAX_TEMPERATURE))
							{
							// przekroczono dozwolon¹ maksymaln¹ temperaturê
							printf("<HTR> dev[%02d]: CLOSED, MAX_TEMPERATURE tmax=%2.3f\n", heater->indx, (float)MAX_TEMPERATURE/1000.0);
							duty_ratio= 0;
							heater->pid_state= HTR_PID_STATE_MAX_TEMPERATURE;
							}

						// zabezpieczenie przed nadmiernym spadkiem temperatury, nawet przy otwartym oknie
						if (heater->temp_current < MIN_TEMPERATURE)
							{
							printf("<HTR> dev[%02d]: OPENED, MIN_TEMPERATURE tmin=%2.3f\n", heater->indx, (float)MIN_TEMPERATURE/1000.0);
							duty_ratio= PWM_DUTY_RATIO_MAX;
							heater->pid_state= HTR_PID_STATE_MIN_TEMPERATURE;
							}





						printf("<HTR> dev[%02d]: therm[%02X] tset=%2.3f toff=%2.3f tdiff=%2.3f\n", heater->indx, heater->thermometer->indx, (float)heater->temp_zadana/1000, (float)heater->temp_offset/1000, (float)temp_uchyb/1000);
						printf("<HTR> dev[%02d]: PID: %4d %4d %4d \n", heater->indx, heater->PID_data.P/1000, heater->PID_data.I/1000, heater->PID_data.D/1000);
						printf("<HTR> dev[%02d]: PID param: %05d  duty_ratio: %04d\n", heater->indx, ctrl_param, duty_ratio);


						if (heater_ctrl_handler->duty_ratio != duty_ratio)
							{
							printf("<HTR> dev[%02d]: PWM duty ratio set to:  %04d\n", heater->indx, duty_ratio);
							pwm_channel_set(heater_ctrl_handler, duty_ratio); // 0 -- pwm_duty_ratio_max
							}


						} // if (thermometer && (queue_dta == 0x00) && thermometer->temp_vaild)
					else
						xSemaphoreGive(thermometer_sem);


					break;
					} // GLOBAL_MODE_HEATING

//--------------------------------------------------------------

				default:
					{
					main_settings.global_mode= GLOBAL_MODE_IDLE;
					break;
					}


				} // switch (main_settings.global_mode)



	prvTempCtrlPIDTask_next_therm:

			heater->temp_prev= heater->temp_current;

			heater_entry= heater_entry->next;

			} //while (heater_entry)


		if (queue_dta == 0x00)
			tempctrl_write2logfile();



		} // while (1)

	}

//-----------------------------------------------------------------------------

k_long temp_pid_process(PID_data_s *PID_data, k_long uchyb)
	{
	k_long result;
    
	PID_data->P= Kp * uchyb;
	PID_data->I= Ki * (uchyb + PID_data->uchyb_prev) / 2 + PID_data->I_prev;
	PID_data->D= Kd * (uchyb - PID_data->uchyb_prev);
	
	PID_data->uchyb_prev= uchyb;
	result= PID_data->P + PID_data->I + PID_data->D;
	result/= 1000;

	if (result < PID_REG_MIN)
        result= PID_REG_MIN;
	else
	if (result > PID_REG_MAX)
		result= PID_REG_MAX;
	else
		PID_data->I_prev= PID_data->I;

	return result;
	}

//-----------------------------------------------------------------------------

k_long pwm_channel_init(heater_ctrl_handler_s *heater_ctrl_handler)
	{
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	uint16_t PrescalerValue;

	static unsigned char GPIOx_clk_enable= 0x00;
	static unsigned char pwm_timer_enabled= 0x00;


	if (!heater_ctrl_handler)
		return -1;

	switch (heater_ctrl_handler->peripheral_addr)
		{

		case (uint32_t)GPIOB:
			{

			if (!(GPIOx_clk_enable & GPIOB_CLK_ENABLE_BIT))
				{
				// only once
				RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
				GPIOx_clk_enable|= GPIOB_CLK_ENABLE_BIT;
				}

			break;
			} // GPIOB

		default:
			{
			return -1;
			}

		} // switch (heater_ctrl_handler->peripheral_addr)


	if (!pwm_timer_enabled)
		{

		PrescalerValue= (uint16_t)(SystemCoreClock / PWM_TIMER_FREQ) - 1;

		if ((SystemCoreClock / PWM_TIMER_FREQ) >= 0x10000)
			printf("<ERR> %s: TIM_Prescaler overrange !\n", __FUNCTION__);

		if (((int)heater_ctrl_handler->period * PWM_TIMER_FREQ) >= 0x10000)
			printf("<ERR> %s: TIM_Period overrange !\n", __FUNCTION__);

		// TIMx configuration
		TIM_TimeBaseStructure.TIM_Period= (uint16_t)(heater_ctrl_handler->period * PWM_TIMER_FREQ);
		TIM_TimeBaseStructure.TIM_Prescaler= PrescalerValue;
		TIM_TimeBaseStructure.TIM_ClockDivision= 0;
		TIM_TimeBaseStructure.TIM_CounterMode= TIM_CounterMode_Up;
		TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);

		// Immediate load of TIM2,TIM3 and TIM4 Prescaler values
		TIM_PrescalerConfig(TIM4, PrescalerValue, TIM_PSCReloadMode_Immediate);

		TIM_ARRPreloadConfig(TIM4, ENABLE);

		// TIM2, TIM3 and TIM4 enable counters
		TIM_Cmd(TIM4, ENABLE);



		pwm_timer_enabled= 0x01;
		}


	GPIO_InitStructure.GPIO_Pin= heater_ctrl_handler->ctrl_pin;
	GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode= GPIO_Mode_Out_PP;
	GPIO_Init((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, &GPIO_InitStructure);
	GPIO_ResetBits((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, heater_ctrl_handler->ctrl_pin);


