glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
	heater_ctrl_handler->duty_ratio= 0;

	return 0;
	}

//-----------------------------------------------------------------------------

k_long pwm_channel_set(heater_ctrl_handler_s *heater_ctrl_handler, uint16_t duty_ratio)
	{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	float duty_f;


	if (!heater_ctrl_handler)
		return -1;


	if (duty_ratio > 1000)
		duty_ratio= 1000;

	heater_ctrl_handler->duty_ratio= duty_ratio;

	if (heater_ctrl_handler->peripheral_addr == NULL)
		return -1;


	if (duty_ratio == 0)
		{
		// PWM OFF

		GPIO_InitStructure.GPIO_Pin= heater_ctrl_handler->ctrl_pin;
		GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode= GPIO_Mode_Out_PP;
		GPIO_Init((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, &GPIO_InitStructure);
		GPIO_ResetBits((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, heater_ctrl_handler->ctrl_pin);

		//TIM_Cmd(TIM3, DISABLE);

		}
	else
	if (duty_ratio == 1000)
		{
		// static ON

		GPIO_InitStructure.GPIO_Pin= heater_ctrl_handler->ctrl_pin;
		GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode= GPIO_Mode_Out_PP;
		GPIO_Init((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, &GPIO_InitStructure);
		GPIO_SetBits((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, heater_ctrl_handler->ctrl_pin);

		//TIM_Cmd(TIM3, DISABLE);

		}
	else
		{
		// PWM ON

		//TIM_Cmd(TIM3, DISABLE);
/*
		PrescalerValue= (uint16_t)(SystemCoreClock / PWM_TIMER_FREQ) - 1;

		// Immediate load of TIM2,TIM3 and TIM4 Prescaler values
		TIM_PrescalerConfig(TIM3, PrescalerValue, TIM_PSCReloadMode_Immediate);
*/
		duty_f= (float)(heater_ctrl_handler->period * PWM_TIMER_FREQ) * (float)duty_ratio / 1000;

		// Output Compare Timing Mode configuration: Channel1
		TIM_OCStructInit(&TIM_OCInitStructure);
		TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
		TIM_OCInitStructure.TIM_OutputState= TIM_OutputState_Enable;
		TIM_OCInitStructure.TIM_Pulse= (uint16_t)duty_f;
		TIM_OCInitStructure.TIM_OCPolarity= TIM_OCPolarity_High;

		switch (heater_ctrl_handler->pwm_chn)
			{

			case 1:
				{
				TIM_OC1Init(TIM4, &TIM_OCInitStructure);
				TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);
				break;
				}

			case 2:
				{
				TIM_OC2Init(TIM4, &TIM_OCInitStructure);
				TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);
				break;
				}

			case 3:
				{
				TIM_OC3Init(TIM4, &TIM_OCInitStructure);
				TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);
				break;
				}

			case 4:
				{
				TIM_OC4Init(TIM4, &TIM_OCInitStructure);
				TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);
				break;
				}

			} // switch (heater_ctrl_handler->pwm_chn)


		//TIM_ARRPreloadConfig(TIM3, ENABLE);

		// TIM2, TIM3 and TIM4 enable counters
		//TIM_Cmd(TIM3, ENABLE);



		GPIO_InitStructure.GPIO_Pin= heater_ctrl_handler->ctrl_pin;
		GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode= GPIO_Mode_AF_PP;
		GPIO_Init((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, &GPIO_InitStructure);

		}


	return 0;
	}

//-----------------------------------------------------------------------------

k_long open_window_status(heater_s *heater)
	{
	time_t now;

	if (!heater)
		return 0;


	now= time(0);

	switch (heater->owp_state)
		{

		case 0x00:
			{
			// detekcja otwarcia okna

			if (heater->owp_begin_time == 0)
				{
				if (heater->temp_current < heater->temp_prev)
					{
					heater->owp_begin_time= now;
					heater->owp_begin_temp= heater->temp_prev;
					}
				}
			else
			if (heater->temp_current >= heater->owp_begin_temp)
				{
				heater->owp_begin_time= 0;
				}
			else
			if ((now - heater->owp_begin_time) <= 600)
				{
				if ((heater->owp_begin_temp - heater->temp_current) >= 1000)
					{
					// wykryto otwarte okno
					// temperatura spad³a o zadan¹ wartosc w czasie krotszym niz ...
					heater->owp_begin_time= now;
					heater->owp_begin_temp= 99999;
					heater->owp_state= 0x01;

					printf("<HTR> dev[%02d]: window opened\n", heater->indx);
					}
				}
			else
				{
				// timeout
				// temperatura nie spadla przez zadany okres
				heater->owp_begin_time= 0;
				heater->owp_state= 0x00;
				}

			break;
			}

		case 0x01:
			{
			// detekcja zamkniêcia okna

			if (heater->temp_current < heater->owp_begin_temp)
				heater->owp_begin_temp= heater->temp_current;
			else
			if ((heater->temp_current - heater->owp_begin_temp) >= 1000)
				{
				// odbicie temperatury od minumum
				// wykryto zamkniête okno

				heater->owp_begin_time= 0;
				heater->owp_state= 0x00;

				printf("<HTR> dev[%02d]: window closed\n", heater->indx);
				}
			else
			if ((now - heater->owp_begin_time) >= 1800) // zabezpieczenie czasowe, jêsli nie by³o odbicia temperatury od minimum
				{
				// timeout 30 min
				// zamkniete okno

				heater->owp_begin_time= 0;
				heater->owp_state= 0x00;

				printf("<HTR> dev[%02d]: window closed, timeout\n", heater->indx);
				}

			break;
			}

		default:
			{
			heater->owp_begin_time= 0;
			heater->owp_state= 0x00;
			break;
			}

		} // switch (heater->owp_state)


	printf("opw: %02X tb %d, td %d, temp_now %5d, temp_prev %5d, temp_begin %5d\n", heater->owp_state, heater->owp_begin_time, now - heater->owp_begin_time, heater->temp_current, heater->temp_prev, heater->owp_begin_temp);

	return heater->owp_state;
	}

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

void tempctrl_write2logfile()
	{
	FRESULT res;
	UINT br;
	wdlist_entry_s *heater_entry= NULL;
	heater_s *heater;

	static u8 buffer_tmp[64];
	static u8 logfile_buffer[LOGFILE_BUFFER_LENGTH];


	if (!logfile_open_f)
		{

		if (SD_Detect() == SD_PRESENT)
			{
			res= f_mount(0, &fs);

